// 8lesson.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	int count = 7;
	for (int i = 0; i < count + 1; i++) {

		}
}








//for (int i = 0; i < 10; i++) {
//	if (i = i % 2) {
//		cout << "2";
//	}
//	else {
//		cout << "1";
//	}
//}
// 
// 
// 
// 
// 
// 
// 
//cout << "* * * * *";
//cout << "*       *";
//cout << "*       *";
//cout << "* * * * *";
//for (int i = 0; i < 5; i++) {
//    for (int y = 0; y < 5; y++) {
//        cout << "123\n";
//    }
//    cout << "Hola\n";
//}
// 
// 
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.